IDEA Open Model
NonConformitySeverity Enumeration
Compatible with IDEA StatiCa 20.1
 Nonconformity severities
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum NonConformitySeverity
Public Enumeration NonConformitySeverity
Members
Member name | Value | Description
Info | 0 |  Information
Warning | 1 |  Deal as warning
Error | 2 |  Error
TerminatedError | 3 |  Error, coancel of the calculation required
See Also
Reference
IdeaRS.OpenModel.Message Namespace